# nnet3-info --verbose=2 exp_FG/LSTM/10.mdl 
# Started at Thu Aug  3 11:29:28 IST 2023
#
nnet3-info --verbose=2 exp_FG/LSTM/10.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000229871, max-change=0.75, linear-params-rms=0.05245, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.81,0.84,0.85,0.87 0.88,0.90,0.94,0.98,1.0 1.0,1.1,1.1,1.1), mean=0.939, stddev=0.0473], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.68, stddev=0.0828], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.73,0.77,0.80,0.88 0.96,1.1,1.6,2.1,2.3 2.4,2.6,2.6,2.8), mean=1.61, stddev=0.49], bias-{mean,stddev}=0.03059,0.9123, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000229871, max-change=0.75, scales-min=-3.0874, scales-max=2.76228, scales-{mean,stddev}=-0.02335,0.9298, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000229871, max-change=0.75, linear-params-rms=0.05286, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.80,0.84,0.85,0.87 0.88,0.90,0.94,0.99,1.0 1.0,1.1,1.1,1.3), mean=0.945, stddev=0.057], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.8 1.8,2.0,2.1,2.1), mean=1.69, stddev=0.0834], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.73,0.77,0.80,0.88 0.97,1.1,1.6,2.1,2.3 2.5,2.6,2.7,2.8), mean=1.62, stddev=0.501], bias-{mean,stddev}=-0.03026,0.933, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000229871, max-change=0.75, scales-min=-3.27156, scales-max=2.84548, scales-{mean,stddev}=0.008564,0.8845, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000229871, max-change=0.75, linear-params-rms=0.05233, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.80,0.84,0.85,0.87 0.88,0.90,0.93,0.97,0.99 1.0,1.0,1.1,1.1), mean=0.936, stddev=0.0438], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.67, stddev=0.084], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.73,0.78,0.80,0.87 0.97,1.1,1.6,2.1,2.3 2.4,2.6,2.6,2.7), mean=1.6, stddev=0.489], bias-{mean,stddev}=0.02034,0.924, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000229871, max-change=0.75, scales-min=-3.2914, scales-max=2.34073, scales-{mean,stddev}=0.05232,0.9057, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000229871, max-change=0.75, linear-params-rms=0.06149, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.81,0.85,0.87,0.88 0.90,0.94,1.1,1.3,1.3 1.4,1.4,1.4,1.7), mean=1.09, stddev=0.16], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.7,1.8,1.9,1.9,2.0 2.6,3.6,3.7,3.9), mean=1.93, stddev=0.371], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.75,0.81,0.83,0.90 1.0,1.2,1.7,2.3,2.8 3.4,4.0,4.2,4.6), mean=1.81, stddev=0.767], bias-{mean,stddev}=-0.002284,0.925, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.02e+05, self-repaired-proportion=0.0101855, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.09,0.11,0.16 0.21,0.30,0.53,0.74,0.82 0.87,0.91,0.92,1.0), mean=0.524, stddev=0.227], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.004,0.04,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.143, stddev=0.0462], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.004,0.005,0.009 0.01,0.02,0.04,0.08,0.10 0.13,0.16,0.19,0.33), mean=0.0522, stddev=0.0389], oderiv-count=304150
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0295418, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.10,0.12,0.18 0.24,0.33,0.55,0.78,0.86 0.90,0.94,0.96,1.0), mean=0.551, stddev=0.228], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.02,0.03,0.05 0.06,0.09,0.15,0.19,0.21 0.21,0.22,0.22,0.23), mean=0.142, stddev=0.0533], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.005,0.008 0.01,0.03,0.10,0.22,0.31 0.38,0.49,0.57,1.2), mean=0.135, stddev=0.135], oderiv-count=310350
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.02e+05, self-repaired-proportion=0.0162241, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.08,0.12,0.16 0.23,0.33,0.57,0.77,0.85 0.89,0.92,0.94,0.96), mean=0.55, stddev=0.228], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.04,0.05,0.06 0.07,0.09,0.15,0.18,0.20 0.20,0.21,0.21,0.23), mean=0.139, stddev=0.0471], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.008,0.01,0.02 0.02,0.03,0.05,0.07,0.08 0.10,0.11,0.12,0.17), mean=0.0522, stddev=0.024], oderiv-count=312350
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.02e+05, self-repaired-proportion=0.101976, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.98,-0.94,-0.91,-0.83 -0.73,-0.55,-0.03,0.53,0.72 0.83,0.92,0.96,0.99), mean=-0.016, stddev=0.531], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.01,0.04,0.08,0.13 0.16,0.20,0.32,0.45,0.52 0.58,0.62,0.64,0.80), mean=0.328, stddev=0.139], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-05,0.002,0.003,0.005 0.008,0.01,0.03,0.05,0.06 0.07,0.09,0.10,0.16), mean=0.0319, stddev=0.0216], oderiv-count=307500
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0559846, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.89,-0.86,-0.78 -0.65,-0.48,-0.03,0.43,0.64 0.77,0.86,0.92,1.0), mean=-0.0132, stddev=0.472], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(2e-05,0.05,0.08,0.14 0.19,0.26,0.51,0.73,0.82 0.88,0.94,0.95,0.99), mean=0.505, stddev=0.237], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.004,0.006,0.01 0.02,0.02,0.05,0.07,0.09 0.11,0.13,0.14,0.24), mean=0.0502, stddev=0.0302], oderiv-count=308850
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.84e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=3.12361e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000930707, count-zeroing-boundaries=39217
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000229871, max-change=0.75, linear-params-rms=0.04775, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.4 1.4,1.4,1.5,1.6,1.7 1.7,1.7,1.7,1.9), mean=1.52, stddev=0.11], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.58,0.64,0.65,0.68 0.72,0.79,1.0,1.3,1.4 1.5,1.6,1.7,1.8), mean=1.05, stddev=0.264], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.33,0.37,0.39,0.45 0.53,0.67,1.1,1.8,2.4 3.1,3.6,3.8,4.2), mean=1.31, stddev=0.791], bias-{mean,stddev}=-0.04722,0.873, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.72e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.59101e-05, count-zeroing-boundaries=38595
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000229871, max-change=1.5, linear-params-rms=0.05275, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.91,1.0,1.1,1.1 1.1,1.1,1.2,1.3,1.3 1.4,1.4,1.4,1.6), mean=1.19, stddev=0.0886], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.0,2.1), mean=1.89, stddev=0.0746], linear-params-singular-values=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.56,0.61,0.64,0.71 0.81,0.97,1.5,2.1,2.6 3.8,4.5,4.8,5.2), mean=1.66, stddev=0.895], bias-{mean,stddev}=0.01715,0.8947, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.004,0.008,0.008,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0203, stddev=0.0188], oderiv-count=183000
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:29:28 IST 2023, elapsed time 0 seconds
