# nnet3-info exp_FG/LSTM/14.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/13.mdl exp_FG/LSTM/14.mdl 
# Started at Thu Aug  3 11:36:09 IST 2023
#
nnet3-info exp_FG/LSTM/14.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000106697, max-change=0.75, linear-params-rms=0.05078, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.78,0.81,0.82,0.84 0.85,0.87,0.90,0.95,0.97 1.0,1.0,1.0,1.1), mean=0.908, stddev=0.0491], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.5 1.6,1.6,1.6,1.6,1.7 1.8,1.9,2.0,2.1), mean=1.62, stddev=0.0864], bias-{mean,stddev}=0.02945,0.8763, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000106697, max-change=0.75, scales-min=-2.96474, scales-max=2.64948, scales-{mean,stddev}=-0.02244,0.8926, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000106697, max-change=0.75, linear-params-rms=0.05117, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.77,0.81,0.82,0.83 0.85,0.87,0.91,0.96,0.99 1.0,1.0,1.1,1.3), mean=0.915, stddev=0.0585], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.5 1.6,1.6,1.6,1.7,1.7 1.7,2.0,2.0,2.1), mean=1.64, stddev=0.0861], bias-{mean,stddev}=-0.02889,0.8963, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000106697, max-change=0.75, scales-min=-3.13558, scales-max=2.73367, scales-{mean,stddev}=0.008396,0.8481, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000106697, max-change=0.75, linear-params-rms=0.05071, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.77,0.82,0.82,0.84 0.85,0.87,0.90,0.94,0.97 0.98,1.0,1.0,1.1), mean=0.907, stddev=0.0451], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.5 1.5,1.6,1.6,1.7,1.7 1.7,2.0,2.0,2.2), mean=1.62, stddev=0.0882], bias-{mean,stddev}=0.01983,0.8876, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000106697, max-change=0.75, scales-min=-3.16327, scales-max=2.24504, scales-{mean,stddev}=0.05022,0.869, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000106697, max-change=0.75, linear-params-rms=0.06021, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.78,0.82,0.83,0.86 0.88,0.91,1.0,1.2,1.3 1.4,1.4,1.4,1.7), mean=1.07, stddev=0.163], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.6 1.6,1.7,1.8,1.9,2.0 2.6,3.6,3.6,3.9), mean=1.89, stddev=0.377], bias-{mean,stddev}=-0.002142,0.8885, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.05e+05, self-repaired-proportion=0.00544107, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.10,0.13,0.18 0.22,0.31,0.54,0.74,0.81 0.87,0.89,0.92,0.98), mean=0.527, stddev=0.219], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.05,0.06,0.06 0.08,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.146, stddev=0.0443], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.003,0.004,0.008 0.01,0.02,0.03,0.06,0.08 0.10,0.12,0.14,0.24), mean=0.0417, stddev=0.0293], oderiv-count=309000
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0200231, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.11,0.13,0.19 0.25,0.34,0.56,0.77,0.85 0.89,0.92,0.94,1.0), mean=0.554, stddev=0.22], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.03,0.04,0.05 0.06,0.09,0.16,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.144, stddev=0.0517], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.02,0.08,0.18,0.24 0.30,0.40,0.47,1.4), mean=0.11, stddev=0.112], oderiv-count=314550
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.00733701, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0003,0.10,0.13,0.18 0.25,0.34,0.57,0.77,0.85 0.88,0.92,0.93,0.96), mean=0.557, stddev=0.22], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0003,0.05,0.05,0.06 0.07,0.10,0.15,0.18,0.20 0.20,0.21,0.21,0.23), mean=0.14, stddev=0.0447], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.007,0.009,0.01 0.02,0.03,0.04,0.06,0.07 0.08,0.09,0.09,0.13), mean=0.043, stddev=0.0194], oderiv-count=310350
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0777807, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.98,-0.93,-0.88,-0.81 -0.71,-0.54,-0.03,0.51,0.69 0.80,0.90,0.94,0.99), mean=-0.0142, stddev=0.516], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.06,0.10,0.14 0.18,0.22,0.32,0.45,0.52 0.57,0.61,0.64,0.79), mean=0.333, stddev=0.133], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.002,0.003,0.005 0.007,0.01,0.02,0.04,0.05 0.06,0.07,0.09,0.12), mean=0.0264, stddev=0.0173], oderiv-count=310700
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.09e+05, self-repaired-proportion=0.0463527, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.86,-0.82,-0.74 -0.63,-0.46,-0.02,0.43,0.62 0.75,0.84,0.91,1.0), mean=-0.0111, stddev=0.464], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.08,0.10,0.16 0.20,0.26,0.51,0.73,0.81 0.87,0.93,0.95,0.99), mean=0.503, stddev=0.23], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(9e-05,0.004,0.005,0.009 0.01,0.02,0.04,0.06,0.07 0.09,0.10,0.11,0.19), mean=0.0418, stddev=0.0244], oderiv-count=310150
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.91e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=3.03548e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000252956, count-zeroing-boundaries=39532
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000106697, max-change=0.75, linear-params-rms=0.04886, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.4 1.4,1.4,1.6,1.7,1.7 1.7,1.8,1.8,1.9), mean=1.56, stddev=0.118], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.55,0.62,0.63,0.67 0.71,0.80,1.0,1.3,1.4 1.6,1.7,1.7,1.8), mean=1.07, stddev=0.28], bias-{mean,stddev}=-0.04543,0.8389, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.78e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0, count-zeroing-boundaries=38905
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000106697, max-change=1.5, linear-params-rms=0.0524, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.89,1.0,1.0,1.1 1.1,1.1,1.2,1.3,1.3 1.4,1.4,1.5,1.6), mean=1.18, stddev=0.0924], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.0,2.1), mean=1.87, stddev=0.076], bias-{mean,stddev}=0.01648,0.8594, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0008,0.007,0.008,0.01 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0203, stddev=0.0188], oderiv-count=178000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/13.mdl exp_FG/LSTM/14.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:0.679189 Lstm1_w_ic:0.298046 Lstm1_W_f-xr:0.849077 Lstm1_w_fc:0.303126 Lstm1_W_o-xr:0.606508 Lstm1_w_oc:0.297532 Lstm1_W_c-xr:1.43231 Lstm1_W-m:1.35375 Final_affine:0.906947 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:40.4341 Lstm1_w_ic:28.5721 Lstm1_W_f-xr:41.0382 Lstm1_w_fc:27.1411 Lstm1_W_o-xr:40.6491 Lstm1_w_oc:27.8543 Lstm1_W_c-xr:44.7213 Lstm1_W-m:40.1653 Final_affine:52.3956 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0166407 Lstm1_w_ic:0.0103256 Lstm1_W_f-xr:0.020496 Lstm1_w_fc:0.0110554 Lstm1_W_o-xr:0.014784 Lstm1_w_oc:0.0105738 Lstm1_W_c-xr:0.0317587 Lstm1_W-m:0.0336751 Final_affine:0.0172044 ]
# Accounting: time=1 threads=1
# Ended (code 0) at Thu Aug  3 11:36:10 IST 2023, elapsed time 1 seconds
