# nnet3-info exp_FG/LSTM/5.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/4.mdl exp_FG/LSTM/5.mdl 
# Started at Thu Aug  3 11:21:34 IST 2023
#
nnet3-info exp_FG/LSTM/5.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000204388, max-change=0.75, linear-params-rms=0.05416, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.88,0.89,0.90 0.92,0.93,0.97,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.969, stddev=0.0411], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.7,1.7,1.7,1.8,1.8 1.8,1.9,2.0,2.1), mean=1.73, stddev=0.063], bias-{mean,stddev}=0.03239,0.9593, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000204388, max-change=0.75, scales-min=-3.24623, scales-max=2.91766, scales-{mean,stddev}=-0.02429,0.9788, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000204388, max-change=0.75, linear-params-rms=0.05451, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.84,0.88,0.89,0.90 0.92,0.94,0.97,1.0,1.0 1.1,1.1,1.1,1.2), mean=0.975, stddev=0.0486], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.7,1.7 1.7,1.7,1.7,1.8,1.8 1.8,2.0,2.0,2.1), mean=1.74, stddev=0.0658], bias-{mean,stddev}=-0.03208,0.9811, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000204388, max-change=0.75, scales-min=-3.45313, scales-max=2.99093, scales-{mean,stddev}=0.008637,0.9343, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000204388, max-change=0.75, linear-params-rms=0.05415, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.84,0.87,0.89,0.91 0.92,0.94,0.97,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.969, stddev=0.041], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.7 1.7,1.7,1.7,1.8,1.8 1.8,2.0,2.0,2.1), mean=1.73, stddev=0.0649], bias-{mean,stddev}=0.02129,0.9717, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000204388, max-change=0.75, scales-min=-3.45358, scales-max=2.4642, scales-{mean,stddev}=0.05519,0.9556, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000204388, max-change=0.75, linear-params-rms=0.06075, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.89,0.90,0.92 0.94,0.97,1.0,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.08, stddev=0.128], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.8,1.9,1.9,2.0 2.3,3.3,3.4,3.6), mean=1.92, stddev=0.295], bias-{mean,stddev}=-0.002468,0.9727, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.03e+05, self-repaired-proportion=0.019495, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.07,0.10,0.14 0.20,0.29,0.55,0.76,0.84 0.90,0.93,0.95,1.0), mean=0.526, stddev=0.238], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-06,0.03,0.04,0.05 0.07,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.141, stddev=0.0496], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.02,0.04,0.07,0.10 0.12,0.16,0.19,0.32), mean=0.0503, stddev=0.0396], oderiv-count=310800
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0399214, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.08,0.10,0.15 0.22,0.31,0.55,0.79,0.87 0.91,0.96,0.98,1.0), mean=0.551, stddev=0.239], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-06,0.01,0.02,0.04 0.06,0.09,0.15,0.20,0.21 0.21,0.22,0.22,0.23), mean=0.141, stddev=0.0567], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.002,0.004,0.006 0.01,0.02,0.09,0.22,0.30 0.39,0.52,0.66,1.3), mean=0.133, stddev=0.145], oderiv-count=310600
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.12e+05, self-repaired-proportion=0.0288894, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(9e-06,0.07,0.09,0.13 0.21,0.31,0.57,0.79,0.87 0.91,0.94,0.95,1.0), mean=0.551, stddev=0.242], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(9e-06,0.03,0.04,0.05 0.06,0.08,0.14,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.136, stddev=0.0512], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.01,0.02 0.02,0.03,0.05,0.07,0.08 0.09,0.11,0.12,0.17), mean=0.0503, stddev=0.0246], oderiv-count=312300
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0957431, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.99,-0.97,-0.93,-0.86 -0.78,-0.57,-0.03,0.55,0.76 0.87,0.95,0.97,1.0), mean=-0.0148, stddev=0.551], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.005,0.03,0.06,0.11 0.15,0.20,0.33,0.47,0.54 0.59,0.64,0.66,0.80), mean=0.336, stddev=0.149], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.001,0.002,0.004 0.007,0.01,0.03,0.05,0.06 0.08,0.10,0.11,0.16), mean=0.0317, stddev=0.0236], oderiv-count=310400
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0656593, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.95,-0.88,-0.79 -0.66,-0.48,-0.01,0.45,0.65 0.80,0.90,0.96,1.0), mean=-0.0112, stddev=0.487], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(2e-06,0.03,0.05,0.13 0.17,0.26,0.51,0.75,0.84 0.90,0.95,0.97,0.99), mean=0.506, stddev=0.249], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-06,0.004,0.006,0.009 0.01,0.02,0.04,0.07,0.09 0.11,0.13,0.14,0.24), mean=0.0486, stddev=0.0307], oderiv-count=313800
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.88e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=2.79365e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000914286, count-zeroing-boundaries=39375
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000204388, max-change=0.75, linear-params-rms=0.04386, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.2,1.2,1.2,1.3 1.3,1.3,1.4,1.5,1.5 1.5,1.6,1.6,1.7), mean=1.4, stddev=0.0917], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.61,0.67,0.68,0.69 0.72,0.76,0.92,1.2,1.3 1.4,1.5,1.5,1.6), mean=0.968, stddev=0.219], bias-{mean,stddev}=-0.04991,0.9181, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.75e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.58065e-05, count-zeroing-boundaries=38750
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000204388, max-change=1.5, linear-params-rms=0.05146, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.95,1.0,1.0,1.1 1.1,1.1,1.1,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.16, stddev=0.0795], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.8,1.8,1.8,1.9,1.9 2.0,2.0,2.0,2.1), mean=1.84, stddev=0.0659], bias-{mean,stddev}=0.01804,0.9408, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.006,0.007,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0188], oderiv-count=190000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/4.mdl exp_FG/LSTM/5.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.01395 Lstm1_w_ic:0.389588 Lstm1_W_f-xr:2.55895 Lstm1_w_fc:0.519199 Lstm1_W_o-xr:1.62514 Lstm1_w_oc:0.426611 Lstm1_W_c-xr:5.13541 Lstm1_W-m:5.4022 Final_affine:3.87004 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:43.6757 Lstm1_w_ic:31.33 Lstm1_W_f-xr:44.3092 Lstm1_w_fc:29.8979 Lstm1_W_o-xr:43.9435 Lstm1_w_oc:30.6298 Lstm1_W_c-xr:46.7103 Lstm1_W-m:37.9628 Final_affine:53.5654 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0457352 Lstm1_w_ic:0.0123055 Lstm1_W_f-xr:0.0573 Lstm1_w_fc:0.017165 Lstm1_W_o-xr:0.0366675 Lstm1_w_oc:0.0137755 Lstm1_W_c-xr:0.109741 Lstm1_W-m:0.14435 Final_affine:0.0723615 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:21:34 IST 2023, elapsed time 0 seconds
