# nnet3-info exp_FG/LSTM/7.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/6.mdl exp_FG/LSTM/7.mdl 
# Started at Thu Aug  3 11:24:39 IST 2023
#
nnet3-info exp_FG/LSTM/7.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000168702, max-change=0.75, linear-params-rms=0.0534, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.83,0.86,0.87,0.89 0.90,0.92,0.95,0.99,1.0 1.0,1.1,1.1,1.1), mean=0.956, stddev=0.043], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.7,1.7,1.7,1.8 1.8,1.9,2.0,2.1), mean=1.71, stddev=0.0698], bias-{mean,stddev}=0.03171,0.9402, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000168702, max-change=0.75, scales-min=-3.18137, scales-max=2.85259, scales-{mean,stddev}=-0.02369,0.9587, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000168702, max-change=0.75, linear-params-rms=0.05381, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.83,0.86,0.87,0.89 0.90,0.92,0.96,1.0,1.0 1.1,1.1,1.1,1.4), mean=0.963, stddev=0.0521], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.7,1.7,1.7,1.8,1.8 1.8,2.0,2.0,2.1), mean=1.72, stddev=0.0717], bias-{mean,stddev}=-0.03133,0.9615, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000168702, max-change=0.75, scales-min=-3.38095, scales-max=2.93195, scales-{mean,stddev}=0.008826,0.914, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000168702, max-change=0.75, linear-params-rms=0.05336, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.83,0.86,0.87,0.89 0.90,0.92,0.95,0.99,1.0 1.0,1.0,1.1,1.1), mean=0.955, stddev=0.0417], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.7,1.7,1.7,1.8 1.8,2.0,2.0,2.1), mean=1.71, stddev=0.0711], bias-{mean,stddev}=0.02094,0.9523, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000168702, max-change=0.75, scales-min=-3.38783, scales-max=2.41467, scales-{mean,stddev}=0.05408,0.9355, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000168702, max-change=0.75, linear-params-rms=0.06086, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.83,0.87,0.89,0.91 0.93,0.95,1.0,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.08, stddev=0.139], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.7 1.7,1.8,1.9,1.9,2.0 2.4,3.4,3.5,3.7), mean=1.92, stddev=0.322], bias-{mean,stddev}=-0.00233,0.9532, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.09e+05, self-repaired-proportion=0.0138948, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.08,0.10,0.15 0.20,0.29,0.54,0.75,0.83 0.88,0.92,0.94,1.0), mean=0.524, stddev=0.232], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.04,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.143, stddev=0.0479], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.005,0.008 0.01,0.02,0.04,0.08,0.10 0.13,0.17,0.18,0.32), mean=0.0514, stddev=0.0396], oderiv-count=306900
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.09e+05, self-repaired-proportion=0.0342203, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.04,0.08,0.11,0.16 0.23,0.32,0.56,0.79,0.86 0.90,0.95,0.97,1.0), mean=0.551, stddev=0.233], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(2e-05,0.01,0.03,0.04 0.06,0.09,0.15,0.19,0.21 0.21,0.22,0.22,0.23), mean=0.142, stddev=0.0549], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.03,0.09,0.22,0.30 0.39,0.52,0.62,1.2), mean=0.135, stddev=0.141], oderiv-count=312200
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.07e+05, self-repaired-proportion=0.0228931, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(3e-05,0.08,0.10,0.15 0.23,0.32,0.57,0.78,0.86 0.90,0.93,0.95,1.0), mean=0.552, stddev=0.236], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(3e-05,0.04,0.04,0.05 0.06,0.09,0.14,0.19,0.20 0.21,0.21,0.21,0.23), mean=0.137, stddev=0.0491], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.01,0.02 0.02,0.03,0.05,0.07,0.08 0.10,0.11,0.12,0.17), mean=0.0514, stddev=0.0246], oderiv-count=315300
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.09e+05, self-repaired-proportion=0.0938651, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.99,-0.96,-0.92,-0.85 -0.75,-0.57,-0.02,0.52,0.75 0.85,0.94,0.97,1.0), mean=-0.0155, stddev=0.543], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.007,0.03,0.06,0.12 0.16,0.20,0.32,0.47,0.54 0.58,0.63,0.66,0.79), mean=0.335, stddev=0.146], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.001,0.003,0.005 0.008,0.01,0.03,0.05,0.06 0.08,0.10,0.11,0.16), mean=0.0319, stddev=0.0229], oderiv-count=310900
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0598806, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.92,-0.87,-0.77 -0.65,-0.48,-0.02,0.44,0.65 0.79,0.89,0.95,1.0), mean=-0.0109, stddev=0.48], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-06,0.04,0.07,0.13 0.19,0.25,0.52,0.75,0.83 0.89,0.95,0.96,0.99), mean=0.507, stddev=0.243], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(3e-05,0.004,0.006,0.01 0.02,0.02,0.05,0.07,0.09 0.11,0.13,0.14,0.24), mean=0.0497, stddev=0.0309], oderiv-count=314000
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.94e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=2.77148e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.00128496, count-zeroing-boundaries=39690
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000168702, max-change=0.75, linear-params-rms=0.04528, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.2,1.3,1.3,1.3 1.3,1.3,1.4,1.5,1.6 1.6,1.6,1.6,1.8), mean=1.45, stddev=0.0984], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.59,0.66,0.67,0.69 0.72,0.77,0.95,1.2,1.3 1.4,1.6,1.6,1.7), mean=0.997, stddev=0.237], bias-{mean,stddev}=-0.04886,0.8999, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.81e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0, count-zeroing-boundaries=39060
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000168702, max-change=1.5, linear-params-rms=0.05188, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.94,1.0,1.0,1.1 1.1,1.1,1.2,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.17, stddev=0.0824], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.8,1.8,1.8,1.9,2.0 2.0,2.0,2.0,2.1), mean=1.85, stddev=0.0692], bias-{mean,stddev}=0.01768,0.9221, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.003,0.007,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0201, stddev=0.019], oderiv-count=188000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/6.mdl exp_FG/LSTM/7.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:1.6662 Lstm1_w_ic:0.353445 Lstm1_W_f-xr:2.08731 Lstm1_w_fc:0.425882 Lstm1_W_o-xr:1.36055 Lstm1_w_oc:0.375163 Lstm1_W_c-xr:4.13847 Lstm1_W-m:4.23376 Final_affine:2.85774 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:42.9379 Lstm1_w_ic:30.6886 Lstm1_W_f-xr:43.5821 Lstm1_w_fc:29.2479 Lstm1_W_o-xr:43.1853 Lstm1_w_oc:29.985 Lstm1_W_c-xr:46.3458 Lstm1_W-m:38.6071 Final_affine:53.4131 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.038471 Lstm1_w_ic:0.011399 Lstm1_W_f-xr:0.0474915 Lstm1_w_fc:0.0144043 Lstm1_W_o-xr:0.0312311 Lstm1_w_oc:0.0123803 Lstm1_W_c-xr:0.088906 Lstm1_W-m:0.110444 Final_affine:0.0533913 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:24:39 IST 2023, elapsed time 0 seconds
