# nnet3-info exp_FG/LSTM/11.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/10.mdl exp_FG/LSTM/11.mdl 
# Started at Thu Aug  3 11:31:08 IST 2023
#
nnet3-info exp_FG/LSTM/11.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000189737, max-change=0.75, linear-params-rms=0.05207, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.80,0.83,0.84,0.86 0.87,0.89,0.93,0.97,0.99 1.0,1.0,1.1,1.1), mean=0.932, stddev=0.0482], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.66, stddev=0.0852], bias-{mean,stddev}=0.03028,0.9032, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000189737, max-change=0.75, scales-min=-3.05653, scales-max=2.73458, scales-{mean,stddev}=-0.02313,0.9203, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000189737, max-change=0.75, linear-params-rms=0.05248, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.83,0.84,0.86 0.87,0.89,0.93,0.98,1.0 1.0,1.1,1.1,1.3), mean=0.939, stddev=0.0579], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.1), mean=1.68, stddev=0.0854], bias-{mean,stddev}=-0.0299,0.9237, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000189737, max-change=0.75, scales-min=-3.23614, scales-max=2.81738, scales-{mean,stddev}=0.008593,0.8749, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000189737, max-change=0.75, linear-params-rms=0.05195, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.84,0.84,0.86 0.87,0.89,0.93,0.97,0.99 1.0,1.0,1.0,1.1), mean=0.93, stddev=0.0444], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.6,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.66, stddev=0.0862], bias-{mean,stddev}=0.02021,0.9147, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000189737, max-change=0.75, scales-min=-3.2583, scales-max=2.31581, scales-{mean,stddev}=0.05186,0.8962, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000189737, max-change=0.75, linear-params-rms=0.06134, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.80,0.84,0.86,0.88 0.90,0.93,1.1,1.2,1.3 1.4,1.4,1.5,1.7), mean=1.09, stddev=0.163], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.7,1.8,1.9,1.9,2.0 2.6,3.6,3.7,3.9), mean=1.93, stddev=0.377], bias-{mean,stddev}=-0.002221,0.9157, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.00920301, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.08,0.11,0.17 0.21,0.30,0.53,0.74,0.82 0.87,0.90,0.92,0.99), mean=0.524, stddev=0.224], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.006,0.04,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.144, stddev=0.0455], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.004,0.005,0.009 0.01,0.02,0.04,0.07,0.10 0.12,0.15,0.16,0.30), mean=0.0495, stddev=0.0361], oderiv-count=310950
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0278996, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.10,0.12,0.18 0.24,0.33,0.55,0.78,0.86 0.90,0.93,0.95,1.0), mean=0.552, stddev=0.226], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(9e-05,0.03,0.03,0.05 0.06,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.142, stddev=0.0528], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.005,0.008 0.01,0.03,0.09,0.21,0.29 0.36,0.46,0.56,1.3), mean=0.129, stddev=0.128], oderiv-count=307550
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.07e+05, self-repaired-proportion=0.0107155, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.09,0.12,0.17 0.24,0.33,0.56,0.77,0.85 0.89,0.92,0.93,0.96), mean=0.551, stddev=0.226], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.05,0.05,0.06 0.07,0.09,0.15,0.18,0.20 0.20,0.21,0.21,0.23), mean=0.139, stddev=0.0462], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.008,0.01,0.02 0.02,0.03,0.05,0.07,0.08 0.09,0.10,0.11,0.15), mean=0.0496, stddev=0.0227], oderiv-count=310200
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0929417, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.98,-0.94,-0.90,-0.83 -0.72,-0.55,-0.03,0.53,0.71 0.83,0.91,0.95,0.99), mean=-0.0146, stddev=0.526], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.05,0.08,0.13 0.17,0.21,0.32,0.45,0.52 0.57,0.61,0.64,0.79), mean=0.328, stddev=0.137], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.002,0.003,0.005 0.008,0.01,0.03,0.04,0.05 0.07,0.08,0.10,0.15), mean=0.0303, stddev=0.0202], oderiv-count=309350
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0508474, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.88,-0.84,-0.75 -0.64,-0.48,-0.02,0.43,0.63 0.77,0.86,0.92,1.0), mean=-0.0111, stddev=0.47], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(2e-05,0.07,0.09,0.15 0.20,0.26,0.51,0.73,0.82 0.87,0.93,0.95,0.99), mean=0.504, stddev=0.235], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-05,0.005,0.007,0.01 0.02,0.02,0.04,0.07,0.08 0.11,0.12,0.13,0.22), mean=0.048, stddev=0.0287], oderiv-count=310350
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.91e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=3.28843e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000619743, count-zeroing-boundaries=39532
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000189737, max-change=0.75, linear-params-rms=0.04827, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.4 1.4,1.4,1.5,1.7,1.7 1.7,1.7,1.8,1.9), mean=1.54, stddev=0.112], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.57,0.63,0.65,0.68 0.72,0.79,1.0,1.3,1.4 1.6,1.7,1.7,1.8), mean=1.06, stddev=0.27], bias-{mean,stddev}=-0.04675,0.8644, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.78e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=1.28518e-05, count-zeroing-boundaries=38905
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000189737, max-change=1.5, linear-params-rms=0.05282, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.91,1.0,1.1,1.1 1.1,1.1,1.2,1.3,1.3 1.4,1.4,1.5,1.6), mean=1.19, stddev=0.09], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,2.0,2.0 2.0,2.0,2.1,2.1), mean=1.89, stddev=0.0755], bias-{mean,stddev}=0.01698,0.8857, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.008,0.01 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0203, stddev=0.0188], oderiv-count=197000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/10.mdl exp_FG/LSTM/11.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:1.23813 Lstm1_w_ic:0.322285 Lstm1_W_f-xr:1.53132 Lstm1_w_fc:0.385847 Lstm1_W_o-xr:1.03495 Lstm1_w_oc:0.335796 Lstm1_W_c-xr:2.84644 Lstm1_W-m:2.84877 Final_affine:1.78161 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:41.5647 Lstm1_w_ic:29.4603 Lstm1_W_f-xr:42.1909 Lstm1_w_fc:27.9998 Lstm1_W_o-xr:41.7655 Lstm1_w_oc:28.7265 Lstm1_W_c-xr:45.7764 Lstm1_W-m:40.0625 Final_affine:53.2278 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.029533 Lstm1_w_ic:0.0108285 Lstm1_W_f-xr:0.0359855 Lstm1_w_fc:0.0136318 Lstm1_W_o-xr:0.0245675 Lstm1_w_oc:0.0115666 Lstm1_W_c-xr:0.0618371 Lstm1_W-m:0.0715195 Final_affine:0.0333808 ]
# Accounting: time=1 threads=1
# Ended (code 0) at Thu Aug  3 11:31:09 IST 2023, elapsed time 1 seconds
