# nnet3-info exp_FG/LSTM/12.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/11.mdl exp_FG/LSTM/12.mdl 
# Started at Thu Aug  3 11:32:49 IST 2023
#
nnet3-info exp_FG/LSTM/12.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000156609, max-change=0.75, linear-params-rms=0.05166, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.82,0.83,0.85 0.87,0.88,0.92,0.96,0.99 1.0,1.0,1.1,1.1), mean=0.924, stddev=0.0487], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.6 1.6,1.6,1.6,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.65, stddev=0.086], bias-{mean,stddev}=0.02999,0.8941, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000156609, max-change=0.75, scales-min=-3.02557, scales-max=2.70548, scales-{mean,stddev}=-0.02302,0.911, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000156609, max-change=0.75, linear-params-rms=0.05207, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.82,0.83,0.85 0.86,0.88,0.92,0.98,1.0 1.0,1.1,1.1,1.3), mean=0.931, stddev=0.0585], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.1), mean=1.66, stddev=0.0862], bias-{mean,stddev}=-0.02956,0.9145, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000156609, max-change=0.75, scales-min=-3.20167, scales-max=2.78913, scales-{mean,stddev}=0.008435,0.8657, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000156609, max-change=0.75, linear-params-rms=0.05155, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.83,0.84,0.85 0.87,0.89,0.92,0.96,0.98 1.0,1.0,1.0,1.1), mean=0.923, stddev=0.0448], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.6 1.6,1.6,1.6,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.65, stddev=0.0874], bias-{mean,stddev}=0.02008,0.9056, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000156609, max-change=0.75, scales-min=-3.226, scales-max=2.29196, scales-{mean,stddev}=0.05138,0.887, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000156609, max-change=0.75, linear-params-rms=0.06105, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.80,0.84,0.85,0.87 0.89,0.93,1.1,1.2,1.3 1.4,1.4,1.4,1.7), mean=1.08, stddev=0.164], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.6,1.6 1.7,1.8,1.8,1.9,2.0 2.6,3.6,3.7,3.9), mean=1.92, stddev=0.379], bias-{mean,stddev}=-0.002182,0.9065, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.14e+05, self-repaired-proportion=0.00653291, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.09,0.12,0.17 0.21,0.30,0.53,0.74,0.81 0.87,0.90,0.92,0.99), mean=0.524, stddev=0.222], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.008,0.05,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.144, stddev=0.0451], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.004,0.005,0.009 0.01,0.02,0.04,0.07,0.09 0.11,0.14,0.15,0.27), mean=0.0463, stddev=0.0333], oderiv-count=308400
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0259473, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.10,0.12,0.18 0.24,0.33,0.56,0.78,0.85 0.89,0.93,0.95,1.0), mean=0.551, stddev=0.224], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.02,0.04,0.05 0.06,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.143, stddev=0.0522], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.03,0.09,0.19,0.28 0.35,0.43,0.50,0.86), mean=0.121, stddev=0.119], oderiv-count=305850
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=1.98e+05, self-repaired-proportion=0.00891264, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.09,0.12,0.17 0.24,0.34,0.57,0.77,0.85 0.89,0.92,0.93,0.96), mean=0.553, stddev=0.223], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.05,0.05,0.06 0.07,0.09,0.15,0.18,0.20 0.20,0.21,0.21,0.23), mean=0.14, stddev=0.0456], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.008,0.01,0.02 0.02,0.03,0.05,0.06,0.08 0.09,0.10,0.10,0.14), mean=0.0471, stddev=0.0214], oderiv-count=310050
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.11e+05, self-repaired-proportion=0.0859873, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.98,-0.93,-0.89,-0.82 -0.72,-0.55,-0.03,0.52,0.71 0.82,0.91,0.95,0.99), mean=-0.0148, stddev=0.523], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.05,0.09,0.13 0.17,0.21,0.31,0.45,0.52 0.57,0.61,0.64,0.78), mean=0.329, stddev=0.135], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.002,0.003,0.005 0.008,0.01,0.03,0.04,0.05 0.06,0.08,0.09,0.14), mean=0.0285, stddev=0.0189], oderiv-count=305550
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0497275, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.88,-0.84,-0.76 -0.64,-0.47,-0.02,0.43,0.63 0.77,0.85,0.91,1.0), mean=-0.0113, stddev=0.467], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.07,0.09,0.15 0.20,0.26,0.51,0.73,0.81 0.87,0.93,0.95,0.99), mean=0.505, stddev=0.233], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-05,0.004,0.006,0.01 0.02,0.02,0.04,0.06,0.08 0.10,0.11,0.12,0.21), mean=0.0452, stddev=0.0268], oderiv-count=311200
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.88e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=1.52381e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000533333, count-zeroing-boundaries=39375
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000156609, max-change=0.75, linear-params-rms=0.04858, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.4 1.4,1.4,1.5,1.7,1.7 1.7,1.8,1.8,1.9), mean=1.55, stddev=0.115], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.56,0.63,0.64,0.68 0.72,0.80,1.0,1.3,1.4 1.6,1.7,1.7,1.8), mean=1.06, stddev=0.275], bias-{mean,stddev}=-0.04629,0.8558, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.75e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=1.29032e-05, count-zeroing-boundaries=38750
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000156609, max-change=1.5, linear-params-rms=0.05276, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.90,1.0,1.1,1.1 1.1,1.1,1.2,1.3,1.3 1.4,1.4,1.5,1.6), mean=1.19, stddev=0.0907], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.1,2.1), mean=1.89, stddev=0.0758], bias-{mean,stddev}=0.01681,0.8768, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.008,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0188], oderiv-count=178000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/11.mdl exp_FG/LSTM/12.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:0.991557 Lstm1_w_ic:0.313291 Lstm1_W_f-xr:1.21929 Lstm1_w_fc:0.362502 Lstm1_W_o-xr:0.842236 Lstm1_w_oc:0.318435 Lstm1_W_c-xr:2.21198 Lstm1_W-m:2.18012 Final_affine:1.39857 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:41.1929 Lstm1_w_ic:29.1612 Lstm1_W_f-xr:41.8131 Lstm1_w_fc:27.7024 Lstm1_W_o-xr:41.3971 Lstm1_w_oc:28.4305 Lstm1_W_c-xr:45.459 Lstm1_W-m:40.1698 Final_affine:52.9952 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0238558 Lstm1_w_ic:0.0106344 Lstm1_W_f-xr:0.0288993 Lstm1_w_fc:0.0129466 Lstm1_W_o-xr:0.0201658 Lstm1_w_oc:0.0110851 Lstm1_W_c-xr:0.0483215 Lstm1_W-m:0.054418 Final_affine:0.0262752 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:32:49 IST 2023, elapsed time 0 seconds
