# nnet3-info exp_FG/LSTM/9.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/8.mdl exp_FG/LSTM/9.mdl 
# Started at Thu Aug  3 11:27:51 IST 2023
#
nnet3-info exp_FG/LSTM/9.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000278495, max-change=0.75, linear-params-rms=0.05278, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.82,0.85,0.86,0.87 0.89,0.91,0.94,0.98,1.0 1.0,1.1,1.1,1.1), mean=0.944, stddev=0.046], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.69, stddev=0.0793], bias-{mean,stddev}=0.03093,0.9216, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000278495, max-change=0.75, scales-min=-3.11846, scales-max=2.79553, scales-{mean,stddev}=-0.02353,0.9394, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000278495, max-change=0.75, linear-params-rms=0.05319, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.81,0.85,0.85,0.87 0.89,0.91,0.94,0.99,1.0 1.1,1.1,1.1,1.3), mean=0.951, stddev=0.0558], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.6,1.7,1.7,1.7,1.8 1.8,2.0,2.0,2.1), mean=1.7, stddev=0.0806], bias-{mean,stddev}=-0.03062,0.9425, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000278495, max-change=0.75, scales-min=-3.30823, scales-max=2.87432, scales-{mean,stddev}=0.008323,0.8941, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000278495, max-change=0.75, linear-params-rms=0.05267, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.81,0.85,0.86,0.87 0.89,0.91,0.94,0.98,1.0 1.0,1.0,1.1,1.1), mean=0.943, stddev=0.043], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.68, stddev=0.0804], bias-{mean,stddev}=0.02051,0.9334, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000278495, max-change=0.75, scales-min=-3.32299, scales-max=2.36373, scales-{mean,stddev}=0.05314,0.9154, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000278495, max-change=0.75, linear-params-rms=0.06138, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.81,0.86,0.87,0.89 0.91,0.94,1.1,1.2,1.3 1.4,1.4,1.4,1.7), mean=1.09, stddev=0.155], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.6,1.6,1.6 1.7,1.8,1.9,1.9,2.0 2.5,3.6,3.7,3.9), mean=1.93, stddev=0.359], bias-{mean,stddev}=-0.002309,0.9343, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.09e+05, self-repaired-proportion=0.0108327, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.08,0.11,0.16 0.20,0.30,0.54,0.74,0.82 0.88,0.91,0.93,1.0), mean=0.524, stddev=0.228], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.04,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.143, stddev=0.0467], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.004,0.006,0.01 0.02,0.02,0.05,0.09,0.12 0.14,0.18,0.21,0.37), mean=0.0584, stddev=0.0438], oderiv-count=307800
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.04e+05, self-repaired-proportion=0.0294413, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.09,0.11,0.17 0.24,0.33,0.56,0.78,0.86 0.90,0.94,0.96,1.0), mean=0.551, stddev=0.229], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-05,0.02,0.03,0.05 0.06,0.09,0.15,0.19,0.21 0.21,0.22,0.22,0.23), mean=0.142, stddev=0.0538], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.003,0.005,0.008 0.01,0.03,0.11,0.25,0.33 0.41,0.55,0.68,1.3), mean=0.15, stddev=0.15], oderiv-count=309750
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.01e+05, self-repaired-proportion=0.0171424, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.08,0.11,0.16 0.23,0.32,0.57,0.78,0.86 0.90,0.93,0.94,0.98), mean=0.551, stddev=0.231], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.04,0.05,0.06 0.07,0.09,0.15,0.19,0.20 0.20,0.21,0.21,0.23), mean=0.138, stddev=0.0478], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.008,0.01,0.02 0.02,0.04,0.06,0.08,0.09 0.11,0.12,0.13,0.19), mean=0.0584, stddev=0.0273], oderiv-count=309000
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.11e+05, self-repaired-proportion=0.0920388, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.99,-0.95,-0.90,-0.84 -0.74,-0.54,-0.03,0.52,0.72 0.84,0.93,0.96,0.99), mean=-0.0159, stddev=0.534], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.01,0.04,0.07,0.13 0.16,0.20,0.32,0.45,0.52 0.58,0.62,0.65,0.80), mean=0.331, stddev=0.14], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-05,0.002,0.003,0.006 0.009,0.01,0.03,0.05,0.07 0.08,0.11,0.12,0.18), mean=0.0361, stddev=0.0248], oderiv-count=309400
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.04e+05, self-repaired-proportion=0.0548453, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.90,-0.84,-0.76 -0.64,-0.47,-0.02,0.43,0.64 0.78,0.87,0.92,1.0), mean=-0.0129, stddev=0.473], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-05,0.06,0.08,0.14 0.19,0.26,0.51,0.74,0.82 0.88,0.94,0.96,0.99), mean=0.506, stddev=0.238], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.005,0.007,0.01 0.02,0.03,0.05,0.08,0.10 0.12,0.14,0.15,0.26), mean=0.0559, stddev=0.034], oderiv-count=307250
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.88e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=5.39683e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.00128254, count-zeroing-boundaries=39375
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000278495, max-change=0.75, linear-params-rms=0.04695, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.3 1.4,1.4,1.5,1.6,1.6 1.7,1.7,1.7,1.8), mean=1.5, stddev=0.106], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.58,0.65,0.66,0.69 0.72,0.78,0.99,1.3,1.4 1.5,1.6,1.7,1.8), mean=1.03, stddev=0.256], bias-{mean,stddev}=-0.04777,0.8817, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.75e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.58065e-05, count-zeroing-boundaries=38750
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000278495, max-change=1.5, linear-params-rms=0.05249, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.92,1.0,1.1,1.1 1.1,1.1,1.2,1.2,1.3 1.4,1.4,1.4,1.6), mean=1.18, stddev=0.0865], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.0,2.1), mean=1.88, stddev=0.0729], bias-{mean,stddev}=0.01732,0.9037, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.007,0.008,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.47), mean=0.0202, stddev=0.0189], oderiv-count=182000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/8.mdl exp_FG/LSTM/9.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.14154 Lstm1_w_ic:0.376231 Lstm1_W_f-xr:2.59705 Lstm1_w_fc:0.512411 Lstm1_W_o-xr:1.7617 Lstm1_w_oc:0.4153 Lstm1_W_c-xr:5.15611 Lstm1_W-m:5.14953 Final_affine:3.13335 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:42.2634 Lstm1_w_ic:30.0716 Lstm1_W_f-xr:42.9024 Lstm1_w_fc:28.6134 Lstm1_W_o-xr:42.4769 Lstm1_w_oc:29.3422 Lstm1_W_c-xr:46.1784 Lstm1_W-m:39.4328 Final_affine:53.3978 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0503183 Lstm1_w_ic:0.0123857 Lstm1_W_f-xr:0.0601145 Lstm1_w_fc:0.0177116 Lstm1_W_o-xr:0.0411569 Lstm1_w_oc:0.0139992 Lstm1_W_c-xr:0.111882 Lstm1_W-m:0.132681 Final_affine:0.0588334 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:27:51 IST 2023, elapsed time 0 seconds
