# nnet3-info exp_FG/LSTM/4.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/3.mdl exp_FG/LSTM/4.mdl 
# Started at Thu Aug  3 11:20:01 IST 2023
#
nnet3-info exp_FG/LSTM/4.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000224968, max-change=0.75, linear-params-rms=0.0545, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.86,0.88,0.89,0.91 0.93,0.94,0.98,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.976, stddev=0.0402], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.7,1.7 1.7,1.7,1.7,1.8,1.8 1.8,1.9,2.0,2.1), mean=1.74, stddev=0.0585], bias-{mean,stddev}=0.03276,0.969, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000224968, max-change=0.75, scales-min=-3.27876, scales-max=2.94494, scales-{mean,stddev}=-0.02449,0.9891, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000224968, max-change=0.75, linear-params-rms=0.05482, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.88,0.89,0.91 0.93,0.94,0.98,1.0,1.0 1.1,1.1,1.1,1.2), mean=0.981, stddev=0.0465], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.7,1.8,1.8 1.8,2.0,2.0,2.1), mean=1.75, stddev=0.0615], bias-{mean,stddev}=-0.03242,0.9909, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000224968, max-change=0.75, scales-min=-3.49077, scales-max=3.02125, scales-{mean,stddev}=0.008549,0.9452, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000224968, max-change=0.75, linear-params-rms=0.05453, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.88,0.89,0.91 0.92,0.94,0.98,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.976, stddev=0.0408], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.7,1.8,1.8 1.8,2.0,2.0,2.1), mean=1.74, stddev=0.0603], bias-{mean,stddev}=0.02148,0.9815, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000224968, max-change=0.75, scales-min=-3.48651, scales-max=2.48735, scales-{mean,stddev}=0.05579,0.9662, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000224968, max-change=0.75, linear-params-rms=0.06045, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.89,0.91,0.93 0.95,0.97,1.0,1.2,1.3 1.3,1.3,1.4,1.6), mean=1.08, stddev=0.119], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.8,1.8,1.9,1.9,2.0 2.2,3.2,3.3,3.5), mean=1.91, stddev=0.275], bias-{mean,stddev}=-0.002422,0.9825, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0256375, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.07,0.08,0.14 0.20,0.28,0.55,0.76,0.84 0.90,0.94,0.96,1.0), mean=0.526, stddev=0.241], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(2e-07,0.03,0.04,0.05 0.07,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.141, stddev=0.0507], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.02,0.04,0.07,0.10 0.12,0.18,0.20,0.30), mean=0.0497, stddev=0.041], oderiv-count=310500
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0431228, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.07,0.09,0.15 0.22,0.32,0.56,0.79,0.87 0.93,0.97,0.99,1.0), mean=0.553, stddev=0.242], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.007,0.02,0.03 0.05,0.09,0.15,0.20,0.21 0.22,0.22,0.22,0.23), mean=0.141, stddev=0.0577], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.002,0.004,0.006 0.01,0.02,0.09,0.22,0.32 0.39,0.55,0.66,1.4), mean=0.133, stddev=0.15], oderiv-count=313300
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.035226, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-06,0.07,0.08,0.13 0.21,0.30,0.57,0.79,0.88 0.91,0.95,0.96,1.0), mean=0.551, stddev=0.246], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-06,0.03,0.03,0.04 0.06,0.08,0.14,0.19,0.20 0.21,0.22,0.22,0.24), mean=0.135, stddev=0.0527], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.009,0.01 0.02,0.03,0.05,0.07,0.08 0.09,0.11,0.12,0.16), mean=0.0493, stddev=0.0243], oderiv-count=306800
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.12e+05, self-repaired-proportion=0.092443, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.99,-0.97,-0.94,-0.87 -0.78,-0.58,-0.03,0.55,0.76 0.88,0.95,0.98,1.0), mean=-0.0163, stddev=0.557], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.004,0.02,0.04,0.10 0.15,0.21,0.33,0.48,0.55 0.60,0.64,0.66,0.81), mean=0.341, stddev=0.153], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.001,0.002,0.004 0.007,0.01,0.03,0.05,0.06 0.08,0.10,0.10,0.16), mean=0.0316, stddev=0.0241], oderiv-count=308100
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0719455, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.95,-0.90,-0.79 -0.67,-0.48,-0.01,0.45,0.66 0.80,0.91,0.97,1.0), mean=-0.0118, stddev=0.492], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.02,0.05,0.10 0.17,0.24,0.52,0.75,0.84 0.91,0.95,0.97,1.0), mean=0.506, stddev=0.253], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-06,0.004,0.005,0.008 0.01,0.02,0.04,0.07,0.09 0.11,0.13,0.14,0.23), mean=0.0478, stddev=0.0303], oderiv-count=309500
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.94e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=3.52734e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000755858, count-zeroing-boundaries=39690
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000224968, max-change=0.75, linear-params-rms=0.04277, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.2,1.2,1.2,1.2 1.3,1.3,1.4,1.4,1.5 1.5,1.5,1.6,1.7), mean=1.37, stddev=0.0873], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.61,0.67,0.68,0.70 0.72,0.75,0.90,1.1,1.2 1.3,1.4,1.5,1.6), mean=0.945, stddev=0.206], bias-{mean,stddev}=-0.05042,0.9274, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.81e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.56016e-05, count-zeroing-boundaries=39060
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000224968, max-change=1.5, linear-params-rms=0.05099, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.96,1.0,1.0,1.0 1.1,1.1,1.1,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.15, stddev=0.0789], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.8,1.8,1.9,1.9 1.9,2.0,2.0,2.0), mean=1.82, stddev=0.0634], bias-{mean,stddev}=0.01822,0.9504, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.004,0.007,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0189], oderiv-count=208000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/3.mdl exp_FG/LSTM/4.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.3031 Lstm1_w_ic:0.426036 Lstm1_W_f-xr:2.90892 Lstm1_w_fc:0.636196 Lstm1_W_o-xr:1.80828 Lstm1_w_oc:0.440299 Lstm1_W_c-xr:5.82403 Lstm1_W-m:6.27759 Final_affine:4.5745 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:44.035 Lstm1_w_ic:31.6596 Lstm1_W_f-xr:44.6589 Lstm1_w_fc:30.2476 Lstm1_W_o-xr:44.321 Lstm1_w_oc:30.9687 Lstm1_W_c-xr:46.7959 Lstm1_W-m:37.4242 Final_affine:53.482 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0518851 Lstm1_w_ic:0.0133123 Lstm1_W_f-xr:0.0646475 Lstm1_w_fc:0.0207793 Lstm1_W_o-xr:0.040461 Lstm1_w_oc:0.0140558 Lstm1_W_c-xr:0.124486 Lstm1_W-m:0.171047 Final_affine:0.08588 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:20:01 IST 2023, elapsed time 0 seconds
