# nnet3-info exp_FG/LSTM/8.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/7.mdl exp_FG/LSTM/8.mdl 
# Started at Thu Aug  3 11:26:12 IST 2023
#
nnet3-info exp_FG/LSTM/8.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000153269, max-change=0.75, linear-params-rms=0.05299, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.83,0.85,0.86,0.88 0.90,0.91,0.95,0.98,1.0 1.0,1.0,1.1,1.1), mean=0.948, stddev=0.0435], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,1.9,2.0,2.1), mean=1.69, stddev=0.0718], bias-{mean,stddev}=0.03138,0.9308, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000153269, max-change=0.75, scales-min=-3.14942, scales-max=2.82377, scales-{mean,stddev}=-0.02358,0.949, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000153269, max-change=0.75, linear-params-rms=0.0534, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.82,0.85,0.86,0.88 0.89,0.91,0.95,0.99,1.0 1.0,1.1,1.1,1.3), mean=0.955, stddev=0.0531], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.7,1.7,1.7,1.8 1.8,2.0,2.0,2.1), mean=1.71, stddev=0.0734], bias-{mean,stddev}=-0.03099,0.9519, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000153269, max-change=0.75, scales-min=-3.34453, scales-max=2.90279, scales-{mean,stddev}=0.008816,0.904, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000153269, max-change=0.75, linear-params-rms=0.05295, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.82,0.86,0.87,0.88 0.89,0.91,0.95,0.98,1.0 1.0,1.0,1.1,1.1), mean=0.948, stddev=0.0419], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.6,1.7,1.7,1.7 1.8,2.0,2.0,2.1), mean=1.69, stddev=0.0732], bias-{mean,stddev}=0.02079,0.9428, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000153269, max-change=0.75, scales-min=-3.35587, scales-max=2.39072, scales-{mean,stddev}=0.05337,0.9255, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000153269, max-change=0.75, linear-params-rms=0.06072, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.82,0.86,0.88,0.90 0.92,0.95,1.0,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.08, stddev=0.143], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.7 1.7,1.8,1.9,1.9,2.0 2.4,3.4,3.5,3.7), mean=1.91, stddev=0.329], bias-{mean,stddev}=-0.0023,0.9437, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.03e+05, self-repaired-proportion=0.0111681, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.05,0.08,0.10,0.16 0.20,0.30,0.54,0.75,0.83 0.88,0.91,0.93,1.0), mean=0.525, stddev=0.23], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.04,0.05,0.06 0.07,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.143, stddev=0.0472], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.003,0.005,0.008 0.01,0.02,0.04,0.07,0.10 0.12,0.16,0.18,0.29), mean=0.0498, stddev=0.0374], oderiv-count=310800
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.0288127, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.04,0.09,0.11,0.16 0.24,0.33,0.56,0.78,0.86 0.90,0.94,0.96,1.0), mean=0.551, stddev=0.23], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(3e-05,0.02,0.03,0.05 0.06,0.09,0.15,0.19,0.21 0.21,0.22,0.22,0.23), mean=0.142, stddev=0.0541], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.03,0.09,0.21,0.29 0.37,0.47,0.58,1.2), mean=0.129, stddev=0.132], oderiv-count=313000
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0197341, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.08,0.11,0.15 0.23,0.33,0.57,0.77,0.86 0.90,0.93,0.95,0.99), mean=0.553, stddev=0.233], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-05,0.04,0.04,0.05 0.07,0.09,0.14,0.19,0.20 0.20,0.21,0.21,0.23), mean=0.137, stddev=0.0483], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.007,0.01,0.02 0.02,0.03,0.05,0.07,0.08 0.09,0.10,0.12,0.17), mean=0.05, stddev=0.0236], oderiv-count=310500
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.03e+05, self-repaired-proportion=0.0916087, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.99,-0.96,-0.91,-0.84 -0.75,-0.55,-0.02,0.53,0.74 0.85,0.94,0.97,0.99), mean=-0.0139, stddev=0.537], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.01,0.03,0.06,0.12 0.16,0.20,0.32,0.46,0.53 0.58,0.63,0.65,0.79), mean=0.333, stddev=0.143], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.002,0.003,0.005 0.008,0.01,0.03,0.05,0.06 0.07,0.09,0.10,0.16), mean=0.031, stddev=0.0218], oderiv-count=311900
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0524922, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.92,-0.85,-0.76 -0.65,-0.47,-0.009,0.45,0.64 0.79,0.88,0.93,1.0), mean=-0.0102, stddev=0.476], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-05,0.05,0.07,0.14 0.19,0.26,0.52,0.74,0.83 0.89,0.94,0.96,0.99), mean=0.505, stddev=0.24], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-05,0.004,0.006,0.01 0.02,0.02,0.04,0.07,0.09 0.11,0.13,0.14,0.23), mean=0.0486, stddev=0.0298], oderiv-count=311900
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.88e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=2.15873e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000634921, count-zeroing-boundaries=39375
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000153269, max-change=0.75, linear-params-rms=0.04578, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.2,1.3,1.3,1.3 1.3,1.4,1.5,1.6,1.6 1.6,1.7,1.7,1.8), mean=1.46, stddev=0.1], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.59,0.65,0.66,0.69 0.72,0.77,0.97,1.2,1.4 1.5,1.6,1.6,1.7), mean=1.01, stddev=0.243], bias-{mean,stddev}=-0.04835,0.8909, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.75e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.58065e-05, count-zeroing-boundaries=38750
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000153269, max-change=1.5, linear-params-rms=0.05196, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.93,1.0,1.0,1.1 1.1,1.1,1.2,1.2,1.3 1.3,1.4,1.4,1.6), mean=1.17, stddev=0.0833], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.0,2.1), mean=1.86, stddev=0.0702], bias-{mean,stddev}=0.0175,0.9129, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.007,0.008,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0188], oderiv-count=200000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/7.mdl exp_FG/LSTM/8.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:1.4779 Lstm1_w_ic:0.33458 Lstm1_W_f-xr:1.82917 Lstm1_w_fc:0.397105 Lstm1_W_o-xr:1.21321 Lstm1_w_oc:0.361292 Lstm1_W_c-xr:3.64567 Lstm1_W-m:3.66477 Final_affine:2.50098 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:42.5599 Lstm1_w_ic:30.3763 Lstm1_W_f-xr:43.2018 Lstm1_w_fc:28.9308 Lstm1_W_o-xr:42.8046 Lstm1_w_oc:29.666 Lstm1_W_c-xr:46.0855 Lstm1_W-m:38.8113 Final_affine:53.2581 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0344196 Lstm1_w_ic:0.0109024 Lstm1_W_f-xr:0.0419707 Lstm1_w_fc:0.0135772 Lstm1_W_o-xr:0.0280931 Lstm1_w_oc:0.0120491 Lstm1_W_c-xr:0.0786623 Lstm1_W-m:0.0949248 Final_affine:0.0468233 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:26:12 IST 2023, elapsed time 0 seconds
