# nnet3-info exp_FG/LSTM/1.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/0.mdl exp_FG/LSTM/1.mdl 
# Started at Thu Aug  3 11:15:24 IST 2023
#
nnet3-info exp_FG/LSTM/1.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.0003, max-change=0.75, linear-params-rms=0.05537, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.88,0.90,0.91,0.93 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.1), mean=0.991, stddev=0.0381], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.8,1.9,1.9), mean=1.77, stddev=0.0412], bias-{mean,stddev}=0.03388,0.9987, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.0003, max-change=0.75, scales-min=-3.37754, scales-max=3.04146, scales-{mean,stddev}=-0.02368,1.022, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.0003, max-change=0.75, linear-params-rms=0.05552, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.87,0.90,0.91,0.93 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.1), mean=0.994, stddev=0.04], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,1.9,2.0), mean=1.78, stddev=0.0434], bias-{mean,stddev}=-0.03347,1.021, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.0003, max-change=0.75, scales-min=-3.60949, scales-max=3.11308, scales-{mean,stddev}=0.009201,0.9829, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.0003, max-change=0.75, linear-params-rms=0.05552, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.87,0.90,0.91,0.93 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.1), mean=0.994, stddev=0.0396], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,1.9,1.9), mean=1.78, stddev=0.0423], bias-{mean,stddev}=0.02192,1.012, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.0003, max-change=0.75, scales-min=-3.59019, scales-max=2.57253, scales-{mean,stddev}=0.05722,1.001, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.0003, max-change=0.75, linear-params-rms=0.05749, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.89,0.92,0.93,0.94 0.96,0.98,1.0,1.1,1.1 1.1,1.2,1.2,1.3), mean=1.03, stddev=0.0612], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.8,1.8,1.9,1.9 1.9,2.4,2.6,2.7), mean=1.83, stddev=0.14], bias-{mean,stddev}=-0.002537,1.013, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.07e+05, self-repaired-proportion=0.0600422, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.04,0.06,0.10 0.16,0.25,0.53,0.81,0.91 0.95,0.99,1.0,1.0), mean=0.531, stddev=0.273], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.003,0.007,0.03 0.05,0.08,0.15,0.20,0.22 0.23,0.23,0.23,0.24), mean=0.142, stddev=0.0626], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0003,0.001,0.001,0.003 0.005,0.009,0.02,0.04,0.05 0.07,0.11,0.12,0.28), mean=0.0264, stddev=0.0257], oderiv-count=309800
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.04e+05, self-repaired-proportion=0.0657195, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.05,0.06,0.12 0.18,0.28,0.56,0.83,0.92 0.98,1.0,1.0,1.0), mean=0.556, stddev=0.271], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.0004,0.003,0.01 0.04,0.07,0.15,0.21,0.22 0.23,0.23,0.24,0.24), mean=0.143, stddev=0.0683], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0003,0.0008,0.001,0.002 0.004,0.009,0.03,0.11,0.18 0.23,0.29,0.45,0.88), mean=0.0682, stddev=0.0909], oderiv-count=311950
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0678598, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-07,0.02,0.04,0.08 0.14,0.26,0.57,0.83,0.90 0.95,0.98,1.0,1.0), mean=0.549, stddev=0.276], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(4e-12,0.002,0.006,0.02 0.04,0.07,0.14,0.20,0.22 0.23,0.23,0.23,0.24), mean=0.137, stddev=0.0652], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.001,0.003,0.004,0.007 0.01,0.02,0.03,0.04,0.05 0.06,0.06,0.07,0.14), mean=0.0294, stddev=0.0154], oderiv-count=309500
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.1e+05, self-repaired-proportion=0.112424, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.99,-0.98,-0.95 -0.88,-0.68,-0.06,0.63,0.86 0.95,0.98,0.99,1.0), mean=-0.0231, stddev=0.617], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0008,0.008,0.02,0.04 0.09,0.20,0.44,0.60,0.66 0.72,0.76,0.78,0.86), mean=0.411, stddev=0.208], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-05,0.0006,0.0007,0.002 0.003,0.005,0.01,0.03,0.04 0.05,0.07,0.08,0.23), mean=0.0196, stddev=0.0197], oderiv-count=305900
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0884646, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-1.0,-0.99,-0.89 -0.78,-0.56,-0.03,0.50,0.73 0.90,0.97,0.99,1.0), mean=-0.021, stddev=0.543], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.0004,0.005,0.04 0.12,0.23,0.54,0.82,0.91 0.96,0.98,0.99,1.0), mean=0.524, stddev=0.289], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(7e-08,0.001,0.002,0.004 0.006,0.01,0.03,0.04,0.05 0.06,0.07,0.08,0.13), mean=0.0278, stddev=0.0181], oderiv-count=312550
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.94e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=3.02343e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000399321, count-zeroing-boundaries=40068
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.0003, max-change=0.75, linear-params-rms=0.03586, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.0,1.1,1.1,1.1 1.1,1.1,1.1,1.2,1.2 1.2,1.3,1.3,1.4), mean=1.15, stddev=0.0457], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.63,0.66,0.68,0.69 0.70,0.71,0.76,0.90,0.97 1.0,1.1,1.1,1.3), mean=0.804, stddev=0.111], bias-{mean,stddev}=-0.05219,0.9562, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.81e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=2.54375e-05, count-zeroing-boundaries=39312
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.0003, max-change=1.5, linear-params-rms=0.04737, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.92,0.96,0.96,0.98 0.99,1.0,1.1,1.1,1.2 1.2,1.2,1.3,1.5), mean=1.07, stddev=0.0671], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.6,1.6,1.6 1.6,1.7,1.7,1.7,1.8 1.8,1.8,1.8,1.9), mean=1.69, stddev=0.0451], bias-{mean,stddev}=0.01878,0.9797, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.003,0.007,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0189], oderiv-count=192000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/0.mdl exp_FG/LSTM/1.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.56954 Lstm1_w_ic:0.702363 Lstm1_W_f-xr:3.19047 Lstm1_w_fc:0.795276 Lstm1_W_o-xr:2.39511 Lstm1_w_oc:0.938122 Lstm1_W_c-xr:8.85846 Lstm1_W-m:11.9671 Final_affine:13.543 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:45.0599 Lstm1_w_ic:32.7154 Lstm1_W_f-xr:45.6336 Lstm1_w_fc:31.4539 Lstm1_W_o-xr:45.4026 Lstm1_w_oc:32.0919 Lstm1_W_c-xr:46.2245 Lstm1_W-m:33.8215 Final_affine:51.9578 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.056556 Lstm1_w_ic:0.021194 Lstm1_W_f-xr:0.0693765 Lstm1_w_fc:0.0248991 Lstm1_W_o-xr:0.0523323 Lstm1_w_oc:0.028845 Lstm1_W_c-xr:0.193477 Lstm1_W-m:0.379726 Final_affine:0.268772 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:15:24 IST 2023, elapsed time 0 seconds
