# nnet3-info exp_FG/LSTM/2.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/1.mdl exp_FG/LSTM/2.mdl 
# Started at Thu Aug  3 11:16:56 IST 2023
#
nnet3-info exp_FG/LSTM/2.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000272555, max-change=0.75, linear-params-rms=0.05512, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.86,0.90,0.91,0.92 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.1), mean=0.987, stddev=0.0386], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,1.9,2.0), mean=1.76, stddev=0.0468], bias-{mean,stddev}=0.03356,0.9887, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000272555, max-change=0.75, scales-min=-3.3456, scales-max=3.00217, scales-{mean,stddev}=-0.02462,1.011, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000272555, max-change=0.75, linear-params-rms=0.05534, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.86,0.90,0.91,0.92 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.2), mean=0.991, stddev=0.0422], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.9,1.9,1.9,2.0), mean=1.77, stddev=0.0495], bias-{mean,stddev}=-0.03313,1.011, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000272555, max-change=0.75, scales-min=-3.5689, scales-max=3.08238, scales-{mean,stddev}=0.008555,0.9691, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000272555, max-change=0.75, linear-params-rms=0.05524, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.87,0.89,0.91,0.92 0.94,0.96,0.99,1.0,1.0 1.1,1.1,1.1,1.1), mean=0.989, stddev=0.0398], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,1.9,2.0), mean=1.77, stddev=0.0489], bias-{mean,stddev}=0.02183,1.001, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000272555, max-change=0.75, scales-min=-3.55343, scales-max=2.53974, scales-{mean,stddev}=0.05718,0.9888, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000272555, max-change=0.75, linear-params-rms=0.05903, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.88,0.91,0.93,0.94 0.96,0.98,1.0,1.1,1.2 1.2,1.3,1.3,1.4), mean=1.05, stddev=0.0905], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.7 1.8,1.8,1.8,1.9,1.9 2.1,2.9,3.0,3.1), mean=1.88, stddev=0.205], bias-{mean,stddev}=-0.002488,1.003, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0410438, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.05,0.07,0.12 0.18,0.27,0.55,0.78,0.88 0.93,0.97,0.98,1.0), mean=0.531, stddev=0.255], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-10,0.02,0.02,0.04 0.06,0.09,0.15,0.19,0.21 0.22,0.22,0.23,0.24), mean=0.141, stddev=0.0557], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.002,0.003,0.006 0.009,0.01,0.03,0.06,0.08 0.11,0.15,0.19,0.27), mean=0.0407, stddev=0.0362], oderiv-count=312700
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0594616, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.07,0.09,0.13 0.20,0.30,0.56,0.82,0.90 0.95,0.99,0.99,1.0), mean=0.559, stddev=0.255], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.003,0.007,0.03 0.05,0.08,0.15,0.20,0.22 0.22,0.23,0.23,0.24), mean=0.14, stddev=0.0628], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0004,0.001,0.002,0.004 0.007,0.02,0.06,0.18,0.27 0.35,0.46,0.65,1.3), mean=0.111, stddev=0.14], oderiv-count=308400
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.01e+05, self-repaired-proportion=0.0538239, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-07,0.04,0.06,0.11 0.17,0.29,0.58,0.81,0.89 0.93,0.97,0.98,1.0), mean=0.552, stddev=0.26], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-09,0.008,0.02,0.03 0.05,0.07,0.14,0.19,0.21 0.21,0.22,0.22,0.24), mean=0.134, stddev=0.0582], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.005,0.007,0.01 0.02,0.02,0.04,0.06,0.07 0.08,0.09,0.10,0.18), mean=0.0421, stddev=0.0218], oderiv-count=303600
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.05e+05, self-repaired-proportion=0.0876799, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.98,-0.96,-0.91 -0.82,-0.61,-0.02,0.55,0.79 0.91,0.97,0.98,1.0), mean=-0.0201, stddev=0.578], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.02,0.03,0.07 0.14,0.22,0.36,0.51,0.58 0.64,0.69,0.70,0.81), mean=0.364, stddev=0.167], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-05,0.0009,0.002,0.003 0.005,0.008,0.02,0.04,0.06 0.07,0.08,0.10,0.15), mean=0.0273, stddev=0.0224], oderiv-count=308600
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.03e+05, self-repaired-proportion=0.0886134, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.98,-0.95,-0.83 -0.71,-0.51,-0.03,0.47,0.71 0.86,0.96,0.98,1.0), mean=-0.0139, stddev=0.514], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.005,0.02,0.06 0.13,0.23,0.51,0.78,0.87 0.93,0.96,0.99,1.0), mean=0.506, stddev=0.269], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-06,0.003,0.004,0.006 0.01,0.02,0.04,0.06,0.07 0.09,0.11,0.11,0.18), mean=0.0403, stddev=0.0263], oderiv-count=307200
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.88e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=2.79365e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000457143, count-zeroing-boundaries=39375
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000272555, max-change=0.75, linear-params-rms=0.0393, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.1,1.1,1.1,1.2 1.2,1.2,1.3,1.3,1.3 1.4,1.4,1.4,1.5), mean=1.26, stddev=0.0703], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.62,0.68,0.68,0.70 0.71,0.73,0.83,1.0,1.1 1.2,1.3,1.3,1.5), mean=0.875, stddev=0.161], bias-{mean,stddev}=-0.05159,0.9465, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.75e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=5.16129e-05, count-zeroing-boundaries=38750
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000272555, max-change=1.5, linear-params-rms=0.04922, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.93,0.97,0.99,1.0 1.0,1.1,1.1,1.2,1.2 1.2,1.3,1.4,1.5), mean=1.11, stddev=0.0737], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.9,1.9,1.9,2.0), mean=1.76, stddev=0.0544], bias-{mean,stddev}=0.01859,0.9698, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.007,0.008,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0189], oderiv-count=176000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/1.mdl exp_FG/LSTM/2.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.81189 Lstm1_w_ic:0.588705 Lstm1_W_f-xr:3.46973 Lstm1_w_fc:0.700062 Lstm1_W_o-xr:2.46262 Lstm1_w_oc:0.750992 Lstm1_W_c-xr:8.03508 Lstm1_W-m:9.46635 Final_affine:7.89042 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:44.7314 Lstm1_w_ic:32.3495 Lstm1_W_f-xr:45.327 Lstm1_w_fc:31.0138 Lstm1_W_o-xr:45.0591 Lstm1_w_oc:31.6957 Lstm1_W_c-xr:46.6339 Lstm1_W-m:35.6353 Final_affine:52.8401 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0624034 Lstm1_w_ic:0.0179947 Lstm1_W_f-xr:0.0760345 Lstm1_w_fc:0.0222567 Lstm1_W_o-xr:0.0542396 Lstm1_w_oc:0.0234013 Lstm1_W_c-xr:0.173827 Lstm1_W-m:0.279891 Final_affine:0.151862 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:16:56 IST 2023, elapsed time 0 seconds
