# nnet3-info exp_FG/LSTM/3.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/2.mdl exp_FG/LSTM/3.mdl 
# Started at Thu Aug  3 11:18:28 IST 2023
#
nnet3-info exp_FG/LSTM/3.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000247621, max-change=0.75, linear-params-rms=0.05483, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.87,0.89,0.90,0.92 0.93,0.95,0.98,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.982, stddev=0.0392], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,1.9,2.0), mean=1.75, stddev=0.0529], bias-{mean,stddev}=0.03318,0.9788, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000247621, max-change=0.75, scales-min=-3.31226, scales-max=2.97444, scales-{mean,stddev}=-0.02469,0.9998, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000247621, max-change=0.75, linear-params-rms=0.05509, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.85,0.89,0.90,0.92 0.93,0.95,0.98,1.0,1.0 1.1,1.1,1.1,1.2), mean=0.986, stddev=0.0443], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,2.0,2.1), mean=1.76, stddev=0.0557], bias-{mean,stddev}=-0.03278,1.001, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000247621, max-change=0.75, scales-min=-3.52972, scales-max=3.05162, scales-{mean,stddev}=0.008416,0.9567, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000247621, max-change=0.75, linear-params-rms=0.05489, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.86,0.89,0.90,0.92 0.93,0.95,0.98,1.0,1.0 1.0,1.1,1.1,1.1), mean=0.983, stddev=0.0403], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.8,1.8 1.8,1.9,2.0,2.0), mean=1.76, stddev=0.0551], bias-{mean,stddev}=0.02166,0.9914, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000247621, max-change=0.75, scales-min=-3.52083, scales-max=2.51169, scales-{mean,stddev}=0.05618,0.9773, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000247621, max-change=0.75, linear-params-rms=0.05992, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.86,0.90,0.92,0.94 0.95,0.97,1.0,1.2,1.2 1.3,1.3,1.3,1.5), mean=1.07, stddev=0.107], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.8,1.8,1.9,1.9,2.0 2.2,3.1,3.2,3.4), mean=1.9, stddev=0.247], bias-{mean,stddev}=-0.002455,0.9925, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.030366, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.04,0.06,0.08,0.13 0.19,0.28,0.54,0.77,0.85 0.91,0.95,0.97,1.0), mean=0.527, stddev=0.246], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-09,0.02,0.03,0.05 0.06,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.141, stddev=0.0523], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.002,0.004,0.007 0.01,0.02,0.04,0.07,0.10 0.13,0.17,0.19,0.25), mean=0.047, stddev=0.0395], oderiv-count=305200
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.11e+05, self-repaired-proportion=0.0493481, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.03,0.07,0.09,0.14 0.21,0.31,0.56,0.80,0.88 0.94,0.97,0.99,1.0), mean=0.555, stddev=0.247], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.007,0.01,0.03 0.05,0.08,0.15,0.20,0.21 0.22,0.22,0.23,0.23), mean=0.14, stddev=0.0595], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.002,0.003,0.005 0.009,0.02,0.08,0.21,0.29 0.39,0.54,0.61,1.5), mean=0.126, stddev=0.148], oderiv-count=305800
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0417387, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1e-06,0.05,0.07,0.12 0.18,0.30,0.57,0.80,0.89 0.92,0.95,0.97,1.0), mean=0.551, stddev=0.253], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(6e-08,0.02,0.03,0.04 0.06,0.08,0.14,0.19,0.20 0.21,0.22,0.22,0.24), mean=0.135, stddev=0.0549], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.006,0.008,0.01 0.02,0.03,0.04,0.07,0.08 0.09,0.10,0.11,0.15), mean=0.0472, stddev=0.0237], oderiv-count=308900
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0904786, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.97,-0.94,-0.89 -0.80,-0.59,-0.03,0.56,0.78 0.90,0.96,0.98,1.0), mean=-0.0188, stddev=0.566], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.003,0.02,0.04,0.09 0.15,0.21,0.34,0.49,0.56 0.61,0.65,0.68,0.80), mean=0.347, stddev=0.158], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.001,0.002,0.003 0.006,0.01,0.02,0.05,0.06 0.08,0.09,0.10,0.15), mean=0.0302, stddev=0.0234], oderiv-count=307800
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.04e+05, self-repaired-proportion=0.0741226, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.97,-0.93,-0.81 -0.68,-0.49,-0.02,0.45,0.69 0.82,0.93,0.97,1.0), mean=-0.0122, stddev=0.499], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.02,0.04,0.08 0.15,0.25,0.52,0.76,0.85 0.92,0.95,0.98,1.0), mean=0.506, stddev=0.259], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(8e-07,0.003,0.005,0.008 0.01,0.02,0.04,0.06,0.08 0.11,0.12,0.13,0.22), mean=0.0453, stddev=0.0291], oderiv-count=307000
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.81e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=1.40809e-05, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000921659, count-zeroing-boundaries=39060
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000247621, max-change=0.75, linear-params-rms=0.04135, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.1,1.2,1.2,1.2 1.2,1.2,1.3,1.4,1.4 1.5,1.5,1.5,1.6), mean=1.32, stddev=0.0816], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.62,0.68,0.68,0.70 0.71,0.74,0.87,1.1,1.2 1.3,1.4,1.4,1.6), mean=0.916, stddev=0.188], bias-{mean,stddev}=-0.05104,0.9368, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.69e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0, count-zeroing-boundaries=38440
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000247621, max-change=1.5, linear-params-rms=0.05029, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.93,0.99,1.0,1.0 1.1,1.1,1.1,1.2,1.2 1.3,1.3,1.4,1.5), mean=1.14, stddev=0.0766], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.6,1.7,1.7,1.7 1.7,1.7,1.8,1.9,1.9 1.9,1.9,1.9,2.0), mean=1.8, stddev=0.0598], bias-{mean,stddev}=0.0184,0.96, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0,0.006,0.007,0.009 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.06,0.46), mean=0.0201, stddev=0.0189], oderiv-count=188000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/2.mdl exp_FG/LSTM/3.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:2.49128 Lstm1_w_ic:0.490128 Lstm1_W_f-xr:3.03938 Lstm1_w_fc:0.636753 Lstm1_W_o-xr:1.99958 Lstm1_w_oc:0.55325 Lstm1_W_c-xr:6.57668 Lstm1_W-m:7.33918 Final_affine:5.77987 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:44.3884 Lstm1_w_ic:32.0032 Lstm1_W_f-xr:44.9967 Lstm1_w_fc:30.6168 Lstm1_W_o-xr:44.6919 Lstm1_w_oc:31.3251 Lstm1_W_c-xr:46.7845 Lstm1_W-m:36.701 Final_affine:53.2661 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0556943 Lstm1_w_ic:0.015151 Lstm1_W_f-xr:0.0670546 Lstm1_w_fc:0.0205313 Lstm1_W_o-xr:0.0443769 Lstm1_w_oc:0.0174551 Lstm1_W_c-xr:0.141028 Lstm1_W-m:0.205953 Final_affine:0.109384 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:18:28 IST 2023, elapsed time 0 seconds
