# nnet3-info exp_FG/LSTM/13.mdl && nnet3-show-progress --use-gpu=no exp_FG/LSTM/12.mdl exp_FG/LSTM/13.mdl 
# Started at Thu Aug  3 11:34:29 IST 2023
#
nnet3-info exp_FG/LSTM/13.mdl 
left-context: 0
right-context: 7
num-parameters: 2503424
modulus: 1
input-node name=input dim=13
component-node name=L0_fixaffine component=L0_fixaffine input=Append(Offset(input, -2), Offset(input, -1), input, Offset(input, 1), Offset(input, 2)) input-dim=65 output-dim=65
component-node name=Lstm1_c_t component=Lstm1_c input=Sum(Lstm1_c1_t, Lstm1_c2_t) input-dim=1024 output-dim=1024
component-node name=Lstm1_i1 component=Lstm1_W_i-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_i2 component=Lstm1_w_ic input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_i_t component=Lstm1_i input=Sum(Lstm1_i1, Lstm1_i2) input-dim=1024 output-dim=1024
component-node name=Lstm1_f1 component=Lstm1_W_f-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_f2 component=Lstm1_w_fc input=IfDefined(Offset(Lstm1_c_t, -1)) input-dim=1024 output-dim=1024
component-node name=Lstm1_f_t component=Lstm1_f input=Sum(Lstm1_f1, Lstm1_f2) input-dim=1024 output-dim=1024
component-node name=Lstm1_o1 component=Lstm1_W_o-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_o2 component=Lstm1_w_oc input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_o_t component=Lstm1_o input=Sum(Lstm1_o1, Lstm1_o2) input-dim=1024 output-dim=1024
component-node name=Lstm1_h_t component=Lstm1_h input=Lstm1_c_t input-dim=1024 output-dim=1024
component-node name=Lstm1_g1 component=Lstm1_W_c-xr input=Append(L0_fixaffine, IfDefined(Offset(Lstm1_r_t, -1))) input-dim=321 output-dim=1024
component-node name=Lstm1_g_t component=Lstm1_g input=Lstm1_g1 input-dim=1024 output-dim=1024
component-node name=Lstm1_c1_t component=Lstm1_c1 input=Append(Lstm1_f_t, IfDefined(Offset(Lstm1_c_t, -1))) input-dim=2048 output-dim=1024
component-node name=Lstm1_c2_t component=Lstm1_c2 input=Append(Lstm1_i_t, Lstm1_g_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_m_t component=Lstm1_m input=Append(Lstm1_o_t, Lstm1_h_t) input-dim=2048 output-dim=1024
component-node name=Lstm1_rp_t component=Lstm1_W-m input=Lstm1_m_t input-dim=1024 output-dim=512
dim-range-node name=Lstm1_r_t_preclip input-node=Lstm1_rp_t dim-offset=0 dim=256
component-node name=Lstm1_r_t component=Lstm1_r input=Lstm1_r_t_preclip input-dim=256 output-dim=256
component-node name=Final_affine component=Final_affine input=Lstm1_rp_t input-dim=512 output-dim=1280
component-node name=Final_log_softmax component=Final_log_softmax input=Final_affine input-dim=1280 output-dim=1280
output-node name=output input=Offset(Final_log_softmax, 5) dim=1280 objective=linear
component name=L0_fixaffine type=FixedAffineComponent, input-dim=65, output-dim=65, linear-params-rms=0.009197, bias-{mean,stddev}=4.967e-05,0.001237
component name=Lstm1_W_i-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000129266, max-change=0.75, linear-params-rms=0.05123, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.82,0.83,0.84 0.86,0.87,0.91,0.96,0.98 1.0,1.0,1.1,1.1), mean=0.917, stddev=0.049], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.5 1.6,1.6,1.6,1.7,1.7 1.8,2.0,2.0,2.2), mean=1.64, stddev=0.0864], bias-{mean,stddev}=0.02973,0.8852, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_ic type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000129266, max-change=0.75, scales-min=-2.99499, scales-max=2.67678, scales-{mean,stddev}=-0.02271,0.9017, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_f-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000129266, max-change=0.75, linear-params-rms=0.05162, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.78,0.82,0.83,0.84 0.86,0.87,0.91,0.97,1.0 1.0,1.1,1.1,1.3), mean=0.923, stddev=0.0586], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.6 1.6,1.6,1.6,1.7,1.7 1.8,2.0,2.0,2.1), mean=1.65, stddev=0.0864], bias-{mean,stddev}=-0.02922,0.9053, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_fc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000129266, max-change=0.75, scales-min=-3.16811, scales-max=2.76136, scales-{mean,stddev}=0.008552,0.8568, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_o-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000129266, max-change=0.75, linear-params-rms=0.05114, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.78,0.82,0.83,0.85 0.86,0.88,0.91,0.95,0.97 0.99,1.0,1.0,1.1), mean=0.915, stddev=0.045], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.5 1.6,1.6,1.6,1.7,1.7 1.7,2.0,2.0,2.2), mean=1.63, stddev=0.088], bias-{mean,stddev}=0.01996,0.8965, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_w_oc type=NaturalGradientPerElementScaleComponent, input-dim=1024, output-dim=1024, learning-rate=0.000129266, max-change=0.75, scales-min=-3.19483, scales-max=2.26865, scales-{mean,stddev}=0.05087,0.8779, rank=8, update-period=10, num-samples-history=2000, alpha=4
component name=Lstm1_W_c-xr type=NaturalGradientAffineComponent, input-dim=321, output-dim=1024, learning-rate=0.000129266, max-change=0.75, linear-params-rms=0.06065, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.79,0.83,0.84,0.86 0.88,0.92,1.0,1.2,1.3 1.4,1.4,1.4,1.7), mean=1.07, stddev=0.164], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.5,1.5,1.5,1.6 1.7,1.8,1.8,1.9,2.0 2.6,3.6,3.7,3.9), mean=1.9, stddev=0.379], bias-{mean,stddev}=-0.002157,0.8974, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_i type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.01e+05, self-repaired-proportion=0.00638777, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.09,0.12,0.18 0.22,0.31,0.53,0.74,0.81 0.87,0.89,0.92,0.99), mean=0.525, stddev=0.22], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.01,0.05,0.05,0.06 0.08,0.10,0.15,0.19,0.20 0.21,0.21,0.22,0.23), mean=0.145, stddev=0.0446], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0006,0.003,0.005,0.008 0.01,0.02,0.04,0.06,0.09 0.10,0.13,0.14,0.26), mean=0.0431, stddev=0.0309], oderiv-count=311700
component name=Lstm1_f type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.0207022, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.06,0.10,0.13,0.19 0.25,0.34,0.56,0.78,0.85 0.89,0.93,0.94,1.0), mean=0.552, stddev=0.222], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.03,0.04,0.05 0.06,0.09,0.15,0.19,0.20 0.21,0.22,0.22,0.23), mean=0.143, stddev=0.0519], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0005,0.003,0.004,0.007 0.01,0.03,0.08,0.18,0.25 0.30,0.37,0.46,0.78), mean=0.111, stddev=0.104], oderiv-count=306450
component name=Lstm1_o type=SigmoidComponent, dim=1024, self-repair-scale=1e-05, count=2.08e+05, self-repaired-proportion=0.0071327, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.10,0.13,0.18 0.24,0.34,0.57,0.77,0.85 0.89,0.92,0.93,0.96), mean=0.555, stddev=0.222], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.05,0.05,0.06 0.07,0.09,0.15,0.18,0.19 0.20,0.21,0.21,0.23), mean=0.14, stddev=0.0451], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.002,0.007,0.009,0.01 0.02,0.03,0.04,0.06,0.07 0.08,0.09,0.10,0.13), mean=0.0441, stddev=0.0199], oderiv-count=306200
component name=Lstm1_g type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2.06e+05, self-repaired-proportion=0.082218, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-0.98,-0.93,-0.88,-0.82 -0.72,-0.54,-0.03,0.52,0.69 0.81,0.90,0.94,0.99), mean=-0.0144, stddev=0.519], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.02,0.05,0.09,0.14 0.17,0.21,0.32,0.45,0.52 0.57,0.61,0.64,0.78), mean=0.331, stddev=0.134], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0001,0.002,0.002,0.005 0.007,0.01,0.02,0.04,0.05 0.06,0.07,0.08,0.13), mean=0.0268, stddev=0.0174], oderiv-count=307150
component name=Lstm1_h type=TanhComponent, dim=1024, self-repair-scale=1e-05, count=2e+05, self-repaired-proportion=0.047547, value-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(-1.0,-0.87,-0.83,-0.75 -0.63,-0.47,-0.02,0.43,0.63 0.76,0.84,0.91,1.0), mean=-0.0115, stddev=0.465], deriv-avg=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(5e-05,0.07,0.10,0.16 0.20,0.26,0.51,0.73,0.81 0.87,0.93,0.95,0.99), mean=0.504, stddev=0.231], oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.0002,0.004,0.006,0.01 0.01,0.02,0.04,0.06,0.07 0.09,0.11,0.12,0.19), mean=0.0424, stddev=0.0249], oderiv-count=308750
component name=Lstm1_c1 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c2 type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_m type=ElementwiseProductComponent, input-dim=2048, output-dim=1024
component name=Lstm1_c type=BackpropTruncationComponent, dim=1024, scale=1, count=7.84e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=7.64965e-06, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0.000331485, count-zeroing-boundaries=39217
component name=Lstm1_W-m type=NaturalGradientAffineComponent, input-dim=1024, output-dim=512, learning-rate=0.000129266, max-change=0.75, linear-params-rms=0.04878, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.3,1.3,1.3,1.4 1.4,1.4,1.6,1.7,1.7 1.7,1.8,1.8,1.9), mean=1.56, stddev=0.116], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.56,0.62,0.64,0.67 0.72,0.80,1.0,1.3,1.4 1.6,1.7,1.7,1.8), mean=1.07, stddev=0.278], bias-{mean,stddev}=-0.04586,0.8473, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Lstm1_r type=BackpropTruncationComponent, dim=256, scale=1, count=7.72e+05, recurrence-interval=1, clipping-threshold=30, clipped-proportion=0, zeroing-threshold=15, zeroing-interval=20, zeroed-proportion=0, count-zeroing-boundaries=38595
component name=Final_affine type=NaturalGradientAffineComponent, input-dim=512, output-dim=1280, learning-rate=0.000129266, max-change=1.5, linear-params-rms=0.05261, linear-params-row-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.90,1.0,1.1,1.1 1.1,1.1,1.2,1.3,1.3 1.4,1.4,1.5,1.6), mean=1.19, stddev=0.0916], linear-params-col-norms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(1.7,1.7,1.7,1.8 1.8,1.8,1.9,1.9,2.0 2.0,2.0,2.1,2.1), mean=1.88, stddev=0.076], bias-{mean,stddev}=0.01664,0.8681, rank-in=20, rank-out=80, num-samples-history=2000, update-period=4, alpha=4
component name=Final_log_softmax type=LogSoftmaxComponent, dim=1280, oderiv-rms=[percentiles(0,1,2,5 10,20,50,80,90 95,98,99,100)=(0.006,0.007,0.008,0.01 0.01,0.01,0.02,0.02,0.03 0.03,0.04,0.05,0.46), mean=0.0202, stddev=0.0189], oderiv-count=193000
nnet3-show-progress --use-gpu=no exp_FG/LSTM/12.mdl exp_FG/LSTM/13.mdl 
LOG (nnet3-show-progress[5.5.1074~1-71f3]:SelectGpuId():cu-device.cc:168) Manually selected to compute on CPU.
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:143) Parameter differences per layer are [ Lstm1_W_i-xr:0.791534 Lstm1_w_ic:0.3031 Lstm1_W_f-xr:0.948124 Lstm1_w_fc:0.315167 Lstm1_W_o-xr:0.695945 Lstm1_w_oc:0.30898 Lstm1_W_c-xr:1.7363 Lstm1_W-m:1.67221 Final_affine:1.09883 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:153) Norms of parameter matrices from <new-nnet-in> are [ Lstm1_W_i-xr:40.815 Lstm1_w_ic:28.8649 Lstm1_W_f-xr:41.4265 Lstm1_w_fc:27.4189 Lstm1_W_o-xr:41.0245 Lstm1_w_oc:28.1386 Lstm1_W_c-xr:45.0996 Lstm1_W-m:40.2002 Final_affine:52.7161 ]
LOG (nnet3-show-progress[5.5.1074~1-71f3]:main():nnet3-show-progress.cc:157) Relative parameter differences per layer are [ Lstm1_W_i-xr:0.0192153 Lstm1_w_ic:0.010394 Lstm1_W_f-xr:0.0226753 Lstm1_w_fc:0.0113769 Lstm1_W_o-xr:0.0168115 Lstm1_w_oc:0.0108679 Lstm1_W_c-xr:0.0381948 Lstm1_W-m:0.0416286 Final_affine:0.0207345 ]
# Accounting: time=0 threads=1
# Ended (code 0) at Thu Aug  3 11:34:29 IST 2023, elapsed time 0 seconds
